answers = {
  1=> {1=> "Ｙｅｓ", 2=> "Ｎｏ"},
  2=> {1=> "怒らない", 2=> "めっちゃ怒る", 3=> "怒らないけどスルー"},
  3=> {1=> "攻めタイプ", 2=> "守りタイプ", 3=> "玉虫色タイプ"},
  4=> {1=> "フォワード", 2=> "ディフェンダー", 3=> "ミッドフィールダー", 4=> "サポーター"},
  5=> {1=> "坂本龍馬", 2=> "吉田松陰", 3=> "高杉晋作", 4=> "大村益次郎", 5=> "西郷隆盛"},
  7=> {1=> "技術力", 2=> "体力", 3=> "気力", 4=> "お人柄", 5=> "その他"},
  9=> {1=> "ヨシ！まかせとけ", 2=> "なんとかがんばろう", 3=> "隣の同僚に目くばせ"},
  10=> {1=> "Ｙｅｓ", 2=> "Ｎｏ"},
  11=> {1=> "高性能ＰＣ", 2=> "書棚", 3=> "空気清浄機", 4=> "広々とした机", 5=> "猫"},
  12=> {1=> "飲む", 2=> "飲みたくない", 3=> "よく飲まれる"},
  13=> {1=> "押し切り", 2=> "受け流し", 3=> "まる投げ", 4=> "ほめ殺し", 5=> "（ヒミツ）"},
  14=> {1=> "メリハリは大切！今すぐ帰る", 2=> "やっぱ仕事優先でしょ～", 3=> "迷うけど、とりあえずLINEで謝っとこー"},
  15=> {1=> "いい機会だ！やってみるぞ", 2=> "思わず伏し目がちになる", 3=> "もし指名されたら、やってもいいかな"},
  16=> {1=> "せっかくだからこの場で質問", 2=> "会話止めるの悪いから聞き役"},
  17=> {1=> "もっとJavaの知識を掘り下げたい", 2=> "他の言語も経験したい", 3=> "開発ではなく管理や営業をやってみたい", 4=> "イヌになりたい"},
  18=> {1=> "通勤", 2=> "定例会議", 3=> "メール対応", 4=> "雑談", 5=> "上司のお守り"}
}

answers.each do |key, hash|
  hash.each do |k, v|
    Answer.create!(
      question_id: key,
      type_id: k,
      answer_desc: v
      )
  end
end